package Java1Lesson1;

public class Main2 {
    public static void main(String[] args) {
        // примитивные типы
        byte a = 1; // целое 8-битное знаковое число от -128 до 127
        short b = 123; // целое 16-битное знаковое число от -32768 до 32767
        int c = 1233; // целое 32-битное знаковое число -2147483648 до 2147483647
        long d = 11212121212L; // целое 64-битное знаковое число -9223372036854775808 до 9223372036854775807
        float f = 3.14f; // – 32-битное знаковое число с плавающей запятой одинарной точности
        double g = 2.343434; // 64-битное знаковое число с плавающей запятой двойной точности
        char e = 'A'; // 16-битный тип данных, предназначенный для хранения символов в кодировке Unicode
        boolean bool = true; // принимает два значения: true и false

        // ссылочный тип
        String str = "Hello";

        // константа
        final double PIII = 3.14; //правило стиля - константы большими буквами
    }
}